Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-1286] Zabbix handles some specified types of errors instead of Windows system, no dialogue boxes pop up
ja: [ZBX-1286] ダイアログボックスがポップアップされないよう、Windowsに代わりZabbixがいくつかの特定の種類のエラーを処理するように変更

source: [DEV-74] Scripts of all nodes are displayed
ja: [DEV-74] すべてのノードのスクリプトを表示

source: [ZBX-3138] fixed bug when disabling application, webitems were disabled too
ja: [ZBX-3138] アプリケーションを無効にするとWebアイテムも無効になるバグを修正

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.2.
ja: ZABBIX SIAはZABBIX 1.6.2のリリースをアナウンスすることを光栄に思います。

source: [ZBX-480] fixed patches for sysmaps_links table
ja: [ZBX-480] sysmaps_linksテーブルのパッチの問題を修正

source: Option to remember user authorisation
ja: ユーザ認証を記録するためのオプション

source: What's New in 1.7.x (alpha)
ja: ZABBIX 1.7.x (alpha)の変更点

source: [ZBX-2264] added opportunity to translate class.cuser.php and config.inc.php
ja: [ZBX-2264] class.cuser.phpやconfig.inc.phpを翻訳できるように修正

source: [ZBX-3239] fixed error in Proxies screen on Oracle, when no proxy defined
ja: [ZBX-3239] プロキシを設定していないときにOracleを利用している環境のプロキシ画面でエラーが出る問題を修正

source: [ZBX-2109] disabled Web monitoring for disabled hosts and hosts under maintenance
ja: [ZBX-2109] 無効の状態のホストとメンテナンス中のホストのWeb監視を無効にするように修正

source: [ZBX-1673] fixed removing hosts from hosts group, when user with permission only on host group updates it
ja: [ZBX-1673] 特定のホストグループにだけ権限を有しているユーザがホストグループを更新した際、(訳注: そのホストに所属する権限のない)ホストがホストグループから削除される問題を修正

source: added server-side transactions for PostgreSQL
ja: PostgreSQLのサーバ側のトランザクションを追加

source: [ZBX-2630] fixed ability to translate various strings in the frontend depending on their context
ja: [ZBX-2630] 前後関係によってはWebインターフェース中の翻訳が異なる文字列になってしまう問題を修正

source: [ZBX-4150] fixed processing of quoted function parameters
ja: [ZBX-4150] クオートされた関数のパラメータの処理を修正

source: [ZBX-633] more debug information in checks_ipmi.c module
ja: [ZBX-633] checks_ipmi.cモジュールにデバッグ詳細情報を追加

source: [ZBX-3463] fixed MaxHousekeeperDelete configuration parameter being ignored for IBM DB2
ja: [ZBX-3463] IBM DB2の場合にMaxHousekeeperDeleteを無視するよう修正

source: In order to upgrade from previous releases, no execution of database patches required.
ja: このリリースでは、以前のリリースからアップグレードするための、データベースへのパッチ適用は必要ありません。

source: fixed detection of __VA_ARGS__
ja: __VA_ARGS__の検出を修正

source: ZABBIX GUI can optionally display information of a single node or the node and its all child nodes.
ja: ZABBIX GUIはオプションでシングルノードやノードとその子ノードの情報を表示することができます。

source: [ZBX-1436] fixed trigger events display after next steps monitoring -> triggers -> click on any event time
ja: [ZBX-1436] 監視データ -> トリガー -> いずれかのイベントの時間をクリックした後のトリガーのイベント表示を修正

source: [ZBX-1857] fixed item form correct processing, removed refreshing when item type is changed
ja: [ZBX-1857] アイテムフォームが正しく処理されるように修正し、アイテムタイプ変更時に画面がリフレッシュしないように修正

source: improved performance of processing of log and text items
ja: ログとテキスト型アイテムの処理パフォーマンスを改善

source: fixed evaluation of {ITEM.LASTVALUE} if the trigger expression consists of several items
ja: いくつかのアイテムからなるトリガーの条件式において{ITEM.LASTVALUE}の評価を修正

source: [ZBX-3420] fixed wrong error message being logged in case of DNS resolution errors
ja: [ZBX-3420] DNS解決エラー時の誤ったエラーログメッセージを修正

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.3.
ja: ZABBIX SIAはZABBIX 1.6.3のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2477] fixed dynamic graphs disappear from screens
ja: [ZBX-2477] スクリーンからダイナミックグラフが消える問題を修正

source: [ZBX-343] fixed possible hang of server trapper process
ja: [ZBX-343] ZABBIXサーバのtrapperプロセスがハングする可能性がある問題を修正

source: [ZBX-2483] fixed showing latest data by filter when clicking from dashboard with GUI option 'Dropdown first entry' -> None
ja: [ZBX-2483] GUIオプション「ドロップダウンの最初の項目」の値をNoneにしてダッシュボードからクリックすると、フィルタで最新のデータが表示される問題を修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.9rc1 (First Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.9rc1 (1番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-3801] added check for duplicate template IDs when creating host through API
ja: [ZBX-3801] APIを利用してホストを作成する際のテンプレートID重複チェックを追加

source: Support of user scripts on Zabbix Agent and IPMI-based commands
ja: ZabbixエージェントやIPMIベースのコマンドのユーザスクリプトのサポート

source: [ZBX-2276] fixed dashboard discovery status header
ja: [ZBX-2276] ダッシュボードのディスカバリステータスのヘッダーを修正

source: fixed "invalid URL" when add user to user group
ja: ユーザグループにユーザ追加時の「無効なURL」を修正

source: [ZBX-768] improved menu linebreaking
ja: [ZBX-768] メニューの禁則処理を改善

source: [ZBX-1661] fixed value mappings retrieval
ja: [ZBX-1661] 値のマッピングの検索(訳注: 複数回SQL文が発行される)を修正

source: [ZBX-3353] fixed skipping web items in the host "Full clone" operation
ja: [ZBX-3353] ホストの"すべて複製"操作でWebアイテムがスキップされていた問題を修正

source: [ZBX-963] removed sid from users map element url
ja: [ZBX-963] マップの表示要素のURLからsidを削除

source: [ZBX-3024] in trigger expression selection popup, expressions are now filtered, depending on item type
ja: [ZBX-3024] トリガーの条件式選択用ポップアップ内でアイテムの型によって条件式をフィルタリングするように修正

source: A nice overview of the new features is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.6.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.6から参照することができます。

source: [ZBX-1553] fixed host group mass activate/disable operation
ja: [ZBX-1553] ホストグループの一括更新の有効/無効の操作を修正

source: [DEV-405] Host Groups, Maintenances moved under "Configuration"
ja: [DEV-405] ホストグループ、メンテナンスを「設定」配下に移動

source: [DEV-260] support of macro TRIGGER.NSEVERITY
ja: [DEV-260] TRIGGER.NSEVERITYマクロを追加

source: [ZBX-1881] fixed checkbox selection cookies
ja: [ZBX-1881] チェックボックス選択のcookieが正常に削除されない問題を修正

source: added support of macros {EVENT.DATE},{EVENT.TIME},{EVENT.AGE} and {ESC.HISTORY}
ja: マクロ{EVENT.DATE}、{EVENT.TIME}、{EVENT.AGE}、{ESC.HISTORY}を追加

source: All ZABBIX modules support IPv6.
ja: すべてのZABBIXモジュールでIPv6を利用することができます。

source: [ZBX-1104] fixed page refreshing with selected range in graphs problem
ja: [ZBX-1104] グラフで範囲選択を行ったときのページのリフレッシュの問題を修正

source: [ZBX-955] fixed bold lines in map links
ja: [ZBX-955] マップリンクの太線表示を修正

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.8.
ja: ZABBIX SIAはZABBIX 1.6.8のリリースをアナウンスすることを光栄に思います。

source: [ZBX-1438] fixed not deleting data from trends_uint table when deleting an item
ja: [ZBX-1438] アイテムを削除した時、trends_uintテーブルからデータが削除されない問題を修正

source: added autodiscovery by ICMP pings
ja: ICMP Pingによるオートディスカバリを追加

source: Adding GET parameter mapname will open the screen with that name, for example: http://zabbix/zabbix/maps.php?mapname=Drag%20and%20drop%20map
ja: それに加えて、マップ名のGETパラメータに名前を指定して画面を開くことができます。例: http://zabbix/zabbix/maps.php?mapname=Drag%20and%20drop%20map20map

source: increased Url field in web scenario to 255 characters
ja: WebシナリオのURLフィールドを255文字に減少

source: [ZBX-975] TRUE/FALSE was replaced to Problems/Ok in Availability Report
ja: [ZBX-975] 稼働レポートのTRUE/FALSEをProblems/Okに置換え

source: [ZBXNEXT-325] added StartDBSyncers parameter for parallel writing to DB
ja: [ZBXNEXT-325] DBに平行書き込みを行うStartDBSyncersパラメータを追加

source: Support of new database engines
ja: 新しいデータベースエンジンのサポート

source: [ZBX-619] fixed agent crash for system.uptime under Solaris 2.5.1
ja: [ZBX-619] Solaris 2.5.1上でsystem.uptimeを利用した場合にエージェントがクラッシュする問題を修正

source: The Installation Wizard provides a convinient way of installing and configuring ZABBIX frontend.
ja: インストールウィザードは、ZABBIXフロントエンドのインストールと設定を容易にします。

source: [ZBXNEXT-508] added dayofmonth to trigger functions
ja: [ZBXNEXT-508] トリガー関数dayofmonthを追加

source: [ZBX-310] fixes for PGSQL
ja: [ZBX-310] PGSQLに関わる修正

source: An entire user group can be configured not to have access to ZABBIX front-end.
ja: ユーザグループを指定してZABBIXフロントエンドにアクセスすることができないように設定することができます。

source: [ZBX-2843] made dashboard and slideshow popup menus have dynamic width
ja: [ZBX-2843] ダッシュボードとスライドショーのポップアップメニューの幅を動的に調整するように変更

source: ZABBIX Agents have been compiled and tested on the following platforms:
ja: ZABBIXエージェントは以下のプラットフォームでコンパイルとテストを行っています。

source: [ZBX-91] added Portuguese translation
ja: [ZBX-91] ポルトガル語を追加

source: [ZBX-1004] made snmp parameters editable in templated items
ja: [ZBX-1004] テンプレートからリンクされたアイテムのSNMPパラメータを修正できるように変更

source: Dynamic Menu
ja: ダイナミックメニュー

source: Added Maintenance Mode
ja: メンテナンスモードの追加

source: [ZBX-1560] fixed typo in application API class call
ja: [ZBX-1560] アプリケーションAPIクラスの呼び出し内の誤記を修正

source: [DEV-358] added notification/trigger description macros {ITEM.LASTVALUE[1..9]}
ja: [DEV-358] 通知用/トリガー名用マクロ{ITEM.LASTVALUE[1..9]}を追加

source: display correct error message if file import fails
ja: ファイルのインポート失敗時に正確なエラーメッセージを表示

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.9.
ja: ZABBIX SIAはZABBIX 1.6.9のリリースをアナウンスすることを光栄に思います。

source: [ZBX-1269] fixed offscreen popups
ja: [ZBX-1269] 画面外のポップアップを修正

source: [ZBX-520] removed action condition "event ack" due to not supported
ja: [ZBX-520] サポートされていないはずの"event ack"アクションコンディション設定を削除

source: [ZBX-1556] fixed importing graphs with items that does not exist in system
ja: [ZBX-1556] システムに存在しないアイテムのグラフのインポート処理を修正

source: [ZBX-1495] fixed map level label location
ja: [ZBX-1495] マップのラベルの表示位置を修正

source: Thanks to Takanori Suzuki
ja: Takanori Suzukiに感謝

source: New internal item was added to monitor Zabbix process state.
ja: Zabbixのプロセスの状態を監視する新しい内部チェックアイテムを追加しました。

source: [ZBX-2304] fixed "no permission" error when screen contains simple graphs with web item
ja: [ZBX-2304] Webアイテムのシンプルグラフが含まれるスクリーンの"権限なし"エラーを修正

source: fixed and improved eventlog monitoring
ja: イベントログ監視の修正と改善

source: [DEV-333] added configuration data cache module (bug fix)
ja: [DEV-333] 設定データのキャッシュモジュールを追加（バグフィックス）

source: Basic management functions
ja: 基本的な管理機能

source: added "-c3" to fping
ja: fpingに"-c3"を付加

source: [ZBX-3610] fixed active agent full buffer bug - stop processing active checks till the buffer is sent
ja: [ZBX-3610] バッファが送信されるまでアクティブチェックの処理が停止してしまうアクティブエージェントのフルバッファのバグを修正

source: [DEV-452] support of s,m,h,d,w,T suffixes in trigger expressions and functions
ja: [DEV-452] トリガー条件式と関数にs、m、h、d、w、Tのサフィックスのサポートを追加

source: [ZBX-534] fixed problem with email messages for discovery events
ja: [ZBX-534] ディスカバリイベントのemailメッセージの問題を修正

source: Added support of UTF-8
ja: UTF-8のサポートを追加

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.6.
ja: ZABBIX SIAはZABBIX 1.6.6のリリースをアナウンスすることを光栄に思います。

source: fixed warning zbx_malloc: allocating already allocated memory in json.c
ja: ワーニング「zbx_malloc: allocating already allocated memory in json.c」を修正

source: [DEV-333] bug fixes for pollers
ja: [DEV-333] pollerのバグフィックス

source: [ZBX-3183] fixed maintenance permission issue
ja: [ZBX-3183] メンテナンスの権限の問題を修正

source: [ZBX-4264] fixed zabbix_agent compilation problem on HP-UX
ja: [ZBX-4264] HP-UXのzabbix_agentのコンパイル時の問題を修正

source: [ZBX-2493] improved default messages for actions
ja: [ZBX-2493] アクションのデフォルトメッセージを改善

source: [ZBX-3947] fixed compilation under AIX 5.2 with enabled IPv6
ja: [ZBX-3947] AIX 5.2でIPv6を有効にしてコンパイルできるよう修正

source: [ZBX-3565] reformating media types in notifications page, adding links to media types
ja: [ZBX-3565] 通知レポート画面内のメディアタイプの表示フォーマット変更しメディアタイプへのリンクを追加

source: fixed data loss of text values processed by proxy
ja: プロキシによるテキストデータ処理におけるデータ消失を修正

source: [ZBX-4043] fixed processing of system.cpu.util on Solaris with non-sequential cpu numbers
ja: [ZBX-4043] CPU番号が連続していないSolarisのsystem.cpu.utilの処理を修正

source: [ZBXNEXT-869] clarify in manpages how the process for runtime signalling is found
ja: [ZBXNEXT-869] 実行中のプロセスがシグナルを受け取った際の動作をmanページに記載

source: [ZBX-2976] fixed server crash when processing zabbix[items_unsupported] under DebugLevel=4
ja: [ZBX-2976] DebugLevel=4設定時にzabbix[items_unsupported]の処理中にサーバがクラッシュするのを修正

source: New drag and drop interface makes creating and editing maps much easier.
ja: 新しいドラッグアンドドロップのインターフェースはマップの作成と修正がより簡単に行なえるようになりました。

source: [DEV-252] improved audit log of host groups,hosts,items and media types
ja: [DEV-252] ホストグループ、ホスト、アイテム、メディアタイプの監査ログを改善

source: Zabbix API was improved to have much more consistent method names and handling of parameters.
ja: Zabbix APIはメソッド名やパラメータの処理に関してより一貫性を向上する改善を行いました。

source: Therefore Zabbix users have a choice of five database engines currently: Oracle, DB2, PostgreSQL, MySQL and SQLite.
ja: これにより、ZabbixユーザはデータベースエンジンとしてOracle、DB2、PostgreSQL、MySQL、SQLiteから選択することができます。

source: New option for host mass update
ja: ホストの一括更新機能の新しいオプション

source: [ZBX-1742] fixed processing of "system.uptime" check under Windows to return values as integers
ja: [ZBX-1742] Windowsの"system.uptime"のチェック処理の返却値を整数に修正

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.7.
ja: ZABBIX SIAはZABBIX 1.6.7のリリースをアナウンスすることを光栄に思います。

source: This simplifies configuration and maintenance of ZABBIX setup very much.
ja: これはZABBIXの設定と管理を容易にします。

source: [ZBX-2234] fixed icon for mass open action in status of triggers
ja: [ZBX-2234] トリガーのステータス画面の一括更新の実行アイコンを修正

source: [ZBX-3961] added recalculation of nextcheck time after changed flexible intervals
ja: [ZBX-3961] 例外の更新間隔を変更した後に次回の更新時刻を再計算するように修正

source: New functionality and improvements
ja: 新しい機能と改善

source: [ZBX-3698] fixed error in log wizard when expression had internal parentheses
ja: [ZBX-3698] ログウィザードで丸括弧が含まれている条件式を使用した場合のエラーを修正

source: [ZBX-936] fixed saving flexible intervals to items linked to templates
ja: [ZBX-936] テンプレートとリンクしているアイテムの例外の更新間隔の保存の問題を修正

source: Zabbix performance was significantly improved by better memory caching as well as decreased load on the database server.
ja: メモリキャッシュを改善したことにより、Zabbixのパフォーマンスが大幅に改善されました。データベースの負荷を削減することができまます。

source: [ZBX-2129] fixed links from monitoring to configuration when All nodes are selected
ja: [ZBX-2129] 全ノード選択時の監視から設定へのリンクを修正

source: User 'guest' can be disabled
ja: ゲストユーザの無効化機能

source: [ZBX-59] removed button "Switch Node"
ja: [ZBX-59] 「Switch Node」ボタンを削除

source: [ZBX-2325] improved groups/hosts selecting for filter dropdowns
ja: [ZBX-2325] フィルタドロップダウンのグループ/ホストの選択を改善

source: Complete List of Bug Fixes and Improvements included into 1.8.10rc1
ja: 1.8.10rc1に含まれるすべてのバグフィックスと改善の一覧

source: Zabbix command line tool
ja: Zabbixコマンドラインツール

source: [ZBX-2511] fixed compilation on FreeBSD with IPv6 due to FD_SETSIZE being undefined
ja: [ZBX-2511] FD_SETSIZEマクロ未定義が原因で起こる、IPv6サポートを有効にしたFreeBSD上でのコンパイルにおける問題を修正

source: Escalation module
ja: エスカレーションモジュール

source: [ZBX-1378] allowed using months in age view
ja: [ZBX-1378] 期間表示に月を使用できるように修正

source: [ZBXNEXT-532] specify timestamp format in zabbix_sender manpage and help output; hint at required item configuration in zabbix_sender manpage
ja: [ZBXNEXT-532] zabbix_senderのmanページにタイムスタンプのフォーマット指定方法と必要なアイテム設定の情報を追加

source: Zabbix Forums (http://www.zabbix.com/forum)
ja: Zabbixフォーラム (http://www.zabbix.com/forum)

source: Poller was enhanced to disable check of item for 4*delay seconds in case of timeout.
ja: タイムアウト時に4×delay秒アイテムのチェックを行ってからdisableになるようにPollerを改善しました。

source: More efficient communication protocol
ja: より効率的な通信プロトコル

source: [ZBXNEXT-236] added support of item keys with brackets ("") in aggregate checks
ja: [ZBXNEXT-236] アグリゲートチェックのアイテムのキーに大括弧("")のサポートを追加

source: The bar graphs can be used in reports.
ja: バーグラフはレポートに利用することができます。

source: [ZBX-3671] fixed ORACLE SQL error when processing of the trigger function count()
ja: [ZBX-3671] トリガー関数count()処理時のOracleのSQLエラーを修正

source: We strongly recommend to upgrade your system!
ja: このリリースはアップグレードすることを強く推奨します!

source: [ZBX-3784] added validation on duplicate discovery rule name
ja: [ZBX-3784] ディスカバリルール名の重複検査を追加

source: Duplicated Login removed
ja: 二重ログインの拒否

source: A brief preview of the new functionality can be found here: http://www.zabbix.com/documentation/1.8/manual/about/what_s_new
ja: 新機能の簡単な概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_newから参照することができます。

source: User macros were extended so that they can be used in both trigger and item names.
ja: ユーザマクロを改善し、トリガー名やアイテム名に利用できるようになりました。

source: [ZBX-2616] bundled DejaVu font upgraded from 2.30 to 2.31
ja: [ZBX-2616] DejaVuフォントを2.30から2.31にアップグレード

source: Complete List of Bug Fixes and Improvements included into 1.8.10rc2
ja: 1.8.10rc2に含まれるすべてのバグフィックスと改善の一覧

source: [ZBX-122] added Hungarian translation
ja: [ZBX-122] ハンガリー語を追加

source: :: Support of PHP 5.3
ja: :: PHP 5.3のサポート

source: fixed wrong aggregate graph drawing
ja: 間違った積算グラフの描画を修正

source: [ZBX-879] fixed maximum 30 issues shown in Dashboard system status
ja: [ZBX-879] ダッシュモードのシステムステータスが30までしか表示されない問題を修正

source: Complete List of Bug Fixes and Improvements included into 1.8.8rc1
ja: 1.8.8rc1に含まれるすべてのバグフィックスと改善の一覧

source: [ZBX-531] fixed plain text line wrapping
ja: [ZBX-531] プレーンテキストの行の重なりを修正

source: Added time filter in "Availability report"
ja: 稼働レポートに時間によるフィルタ機能を追加

source: Re-design of unknown events and triggers
ja: 不明なイベントとトリガーの再設計

source: fixed problem with "Too many open files" by agent under Solaris 2.5, 2.6
ja: Solaris 2.5、2.6上のエージェントによる「Too many open files」の問題を修正

source: It is almost feature complete but does not fully represent expected 2.0 version.
ja: まだすべての機能は実装されておらず、2.0バージョンで予定している機能のすべてが含まれているわけではありません。

source: fixed simple/advanced item filter switch
ja: アイテムの標準/拡張フィルタの切替を改善

source: [ZBX-1862] fixed host creation with link to templates with trigger dependencies
ja: [ZBX-1862] 依存関係を持つトリガーが含まれるテンプレートをリンクしてホストを作成する際の問題を修正

source: [ZBX-3681] fixed API to leave internal PHP encoding in UTF-8
ja: [ZBX-3681] APIの内部エンコーディング処理後に必ずPHPのエンコーディングをUTF-8に設定するように修正

source: [ZBX-2051] fixed memory leak in processing of calculated items
ja: [ZBX-2051] 計算アイテムの処理のメモリリークを修正

source: added ability to edit user medias
ja: ユーザのメディアを編集する機能を追加

source: [ZBX-608] added sorting to templates column in hosts screen
ja: [ZBX-608] ホスト画面にテンプレートの列によるソート機能を追加

source: historical data is now available for "not supported" items
ja: 「not supported」状態のアイテムの履歴データを表示可能

source: other improvements
ja: その他の改善

source: ZABBIX Server has been tested on the following platforms:
ja: ZABBIXサーバは以下のプラットフォームでテストを行っています。

source: [ZBX-651] fixed possible memory leak in autodiscovery actions
ja: [ZBX-651] オートディスカバリのアクションにメモリリークが発生する可能性がある問題を修正

source: [ZBXNEXT-426] added dashboard option to show unack problems
ja: [ZBXNEXT-426] ダッシュボードに障害対応コメント未入力の障害を表示するオプションを追加

source: [ZBX-4059] fixed a potential buffer overflow in item parameter parsing
ja: [ZBX-4059] アイテムのパラメータ解析時の潜在的なバッファオーバーフローを修正

source: [DEV-137] help link redirected to on-line documentation at www.zabbix.com/documentation/
ja: [DEV-137] ヘルプリンクをオンラインドキュメント www.zabbix.com/documentation/ へリダイレクト

source: [ZBX-4351] updated French translation; thanks to Joseph Bueno
ja: [ZBX-4351] フランス語翻訳を更新; Joseph Buenoに感謝

source: It requires recompilation of ZABBIX Server and installation of new front-end only.
ja: ZABBIXサーバーのリコンパイルとWEBフロントエンドの再インストールが必要です。

source: [ZBX-2190] fixed trigger expression check for syntax
ja: [ZBX-2190] トリガーの条件式の構文チェックを修正

source: Note that database patches eixst for MySQL and PostgreSQL only.
ja: データベースのパッチはMySQLとPostgreSQL用のみ存在します。

source: [ZBX-2352] fixed typo in the default locale
ja: [ZBX-2352] デフォルトのロケールにおける誤字を修正

source: [ZBX-350] fixed processing in_condition under Oracle
ja: [ZBX-350] Oracle利用時のin_conditionの処理を修正

source: [ZBX-404] fixed update of item "Download speed for scenario '...'"
ja: [ZBX-404] "Download speed for scenario '...'"アイテムの更新を修正

source: [ZBX-3480] fixed possible crash of server after shutdown of ORACLE server
ja: [ZBX-3480] ORACLEサーバのシャットダウン後にサーバがクラッシュする問題を修正

source: A nice overview of the new features is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.2.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.2から参照することができます。

source: [DEV-341] added hint with previous 20 events in Dashboard's widget "Last 20 issues" on mouse-over
ja: [DEV-341] ダッシュボードの「最新20件の障害」ヴィジットのマウスオーバー時に直前の20イベントのヒント表示を追加

source: List of Bug Fixes included into 1.8.9rc2
ja: 1.8.9rc2に含まれるバグフィックスの一覧

source: New parameter, 'count', can be used to filter data processed by this function.
ja: 新しいパラメータcountは、この関数によってフィルタ処理されたデータを利用することができます。

source: fixed possible server crash when using {TRIGGER.NAME} for notifications
ja: 通知に{TRIGGER.NAME}を使用した場合にサーバがクラッシュする可能性がある問題を修正

source: [ZBX-861] fixed problem with disappearing nodes in frontend
ja: [ZBX-861] Webインターフェース上でノードが表示されなくなる問題を修正

source: Zabbix Support (http://www.zabbix.com/support.php)
ja: Zabbixサポート (http://www.zabbix.com/support.php)

source: [ZBX-602] fixed possible incorrect trigger evaluation if value sotred as "delta"
ja: [ZBX-602] 値を差分で保存している場合に、トリガーが誤った評価を行う可能性がある問題を修正

source: [ZBX-1276] fixed import template as template if status tag is after groups tag in xml
ja: [ZBX-1276] xmlファイルでグループタグの後にステータスタグがあるようなテンプレートのインポート処理の問題を修正

source: See SNMP section for more details.
ja: より詳細な情報はSNMPのセクションを参照してください。

source: [ZBX-2039] fixed pattern matching in function count
ja: [ZBX-2039] count関数内のパターンマッチングを修正

source: dependent triggers are not counted in SoT
ja: トリガーのステータス画面では依存しているトリガーをカウントしないように修正

source: added Korean locale, thanks to Kodai
ja: 韓国語の翻訳を追加; Kodaiに感謝

source: In this case, the information displayed in the element will depend on the particular host selected by ZABBIX user.
ja: この場合、要素に表示される情報はユーザによって選択された個々のホストに依存します。

source: [ZBX-2905] fixed single trigger name expanding, unknown problem count and duplicate elements count in network maps
ja: [ZBX-2905] ネットワークマップ上で障害が1つのみの時のトリガー名の展開、不明なトリガー数の表示、重複する要素の数の表示を修正

source: fixed sql error when filter items by host group
ja: アイテムのフィルタでホストグループを使用した際のSQLエラーを修正

source: Mass updates of items made easy!
ja: 大量のアイテム更新を簡単に行うことができます。

source: fixed month representation in seconds in most busy triggers report
ja: 最も多く障害が発生しているトリガーのレポートにおいて月表示を数秒で表示するように修正

source: [ZBX-3944] added support of multibyte NIC names for the net.if.* checks under Windows
ja: [ZBX-3944] Windowsのnet.if.*チェックにNIC名のマルチバイト対応を追加

source: Dynamic Screens
ja: 動的な画面

source: Basic Management Functions
ja: 基本的な管理機能

source: improved icmpping* processing.
ja: icmppingの処理の改善

source: Upgrade script for MySQL and PostgreSQL are provided.
ja: MySQLとPostgreSQL用のアップデートスクリプトが提供されています。

source: Detailed host availability information
ja: ホストの可用性情報の詳細

source: [ZBX-2306] improved starting zoom on edges
ja: [ZBX-2306] 拡大表示(zoom)におけるグラフの端の部分を改善

source: added checkbox range selection by Ctrl+Click
ja: Ctrl+Clickによるチェックボックスの範囲選択機能を追加

source: Zabbix Company provides a full range of professional services.
ja: Zabbix SIAはプロフェッショナルサービスを全面的に提供しています。

source: SLA downtimes are supported for better calculation of service availability.
ja: SLAダウンタイムはサービス稼働時間のより良い計算を提供します。

source: [ZBX-2326] fixed dynamic chart titles, now all symbols are rendered correctly
ja: [ZBX-2326] ダイナミックグラフのタイトルにすべての記号が正しく描画されるように修正

source: [ZBX-2843] fixed log trigger creation menu in items list
ja: [ZBX-2843] アイテムリストのログトリガー作成メニューを修正

source: [ZBX-2135] fixed screens ignore nodes "All" option in selection dropdown
ja: [ZBX-2135] ドロップダウンリストからノードに「全て」を選択した際にスクリーンに反映されない問題を修正

source: Any number of triggers can be linked to map link.
ja: マップリンクに複数のトリガーをリンクさせることができます。

source: New Dashboard widget: Host Status
ja: 新しいダッシュボードウィジット: ホストステータス

source: Multiple operations (notifications, script execution) per action are supported.
ja: アクションあたり複数の操作(通知、スクリプト実行)をサポート

source: [ZBX-3446] fixed possible hang of pollers - added timeout handler for external scripts
ja: [ZBX-3446] 外部スクリプトのタイムアウト処理を追加しpollerのハングアップがハングアップする問題を修正

source: [ZBX-1078] changed link in server info screen element
ja: [ZBX-1078] スクリーンのサーバ情報の項目のリンクを変更

source: What's important
ja: 重要な変更点

source: [ZBX-849] fixed permissions problem for users in dashboard
ja: [ZBX-849] ダッシュボードのユーザーの権限の問題を修正

source: [ZBX-3216] fixed setup not catching existing configuration file on step 6
ja: [ZBX-3216] セットアップのステップ6で設定ファイルの存在を判別できない問題を修正

source: [ZBX-2384] fixed status of triggers elements in screens
ja: [ZBX-2384] スクリーンのトリガー要素の状態が正しく表示できない問題を修正
